Repository: martin-robert-fink/oauth_client_demo
Catalog: lib/l10n/intl_*.arb
Languages: ar, he

# appTitle
source: This is the OAuth Client Demo
ar: هذا عرض تجريبي لعميل OAuth
he: זו הדגמת לקוח של OAuth

source: Signin with Facebook
ar: قم بتسجيل الدخول باستخدام الفيسبوك
he: היכנס באמצעות פייסבוק

source: Signin with Github
ar: تسجيل الدخول مع جيثب
he: היכנס באמצעות Github

source: Signin with Google
ar: تسجيل الدخول مع جوجل
he: היכנס באמצעות Google

source: Signin with Apple
ar: تسجيل الدخول مع أبل
he: היכנס עם אפל

source: Authentication Failed
ar: المصادقة فشلت
he: אימות נכשל

source: Unknown reason
ar: سبب غير معلوم
he: סיבה לא ידועה

# noTokenData
source: Error getting token data
ar: خطأ في الحصول على بيانات الرمز المميز
he: שגיאה בקבלת נתוני אסימון

# timeoutAuthServer
source: Timeout attempting to connect to authentication server
ar: مهلة محاولة الاتصال بخادم المصادقة
he: פסק זמן מנסה להתחבר לשרת אימות

# timeoutTokenWait
source: Timeout waiting for token
ar: مهلة انتظار الرمز المميز
he: פסק זמן מחכה לאסימון

# noAuthUrl
source: Unable to launch authentication url
ar: غير قادر على إطلاق رابط التوثيق
he: לא ניתן להפעיל את כתובת האתר לאימות

# noClientId
source: Error getting client ID from host
ar: خطأ في الحصول على معرّف العميل من المضيف
he: שגיאה בקבלת מזהה הלקוח מהמארח

# noIdToken
source: No ID Token received from host
ar: لم يتم استلام رمز معرف من المضيف
he: לא התקבל אסימון מזהה מהמארח

# noAddTask
source: Unable to add new task
ar: غير قادر على إضافة مهمة جديدة
he: לא ניתן להוסיף משימה חדשה

source: No Tasks
ar: لا توجد مهام
he: אין משימות

# errorGettingTaskData
source: Unable to get taks data from server
ar: تعذر الحصول على بيانات المهمة من الخادم
he: אין משימות

# errorTaskStatus
source: Status: {status}; Details: {details}
ar: {details} تفاصيل: {status} حالة:
he: {details} פרטים: ;{status} סטָטוּס:

source: Start Date:
ar: תאריך התחלה:
he: תאריך התחלה:

source: Due Date:
ar: תאריך להגשה:
he: תאריך להגשה:

source: Priority:
ar: עדיפות:
he: עדיפות:

source: Complete:
ar: לְהַשְׁלִים:
he: לְהַשְׁלִים:

source: Tasks
ar: مهام
he: משימות

# task
source: Task {number}
ar: {number} مهمة
he: {number} מְשִׁימָה

# taskDetail
source: Task detailed description {number}
ar: {number} وصف تفصيلي للمهمة
he: {number} תיאור מפורט של המשימה
